app/models/item.rb

SELECT "families".* FROM "families" WHERE "families"."is_default" = TRUE LIMIT 1
---
  def set_default_family
    # family_idが既に設定されている場合はスキップ
    return if self.family_id.present?

    default_family = Family.find_by(is_default: true)